{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"meantemperature:0": {"name": "meantemperature:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "totalrain:0": {"name": "totalrain:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "totalsnow:0": {"name": "totalsnow:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}, "outputs": {"dense_25": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model_12/normalization_24/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model_12/normalization_25/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model_12/normalization_26/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_12/concatenate_12/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_12/dense_24/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/model_12/dense_24/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_12/dense_25/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_12/dense_25/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "meantemperature", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "totalrain", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "totalsnow", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_12/normalization_24/sub", "op": "Sub", "input": ["meantemperature", "unknown"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_12/normalization_25/sub", "op": "Sub", "input": ["totalrain", "unknown_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_12/normalization_26/sub", "op": "Sub", "input": ["totalsnow", "unknown_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_12/normalization_24/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model_12/normalization_24/sub", "ConstantFolding/StatefulPartitionedCall/model_12/normalization_24/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_12/normalization_25/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model_12/normalization_25/sub", "ConstantFolding/StatefulPartitionedCall/model_12/normalization_25/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_12/normalization_26/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model_12/normalization_26/sub", "ConstantFolding/StatefulPartitionedCall/model_12/normalization_26/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_12/concatenate_12/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_12/normalization_24/truediv", "StatefulPartitionedCall/model_12/normalization_25/truediv", "StatefulPartitionedCall/model_12/normalization_26/truediv", "StatefulPartitionedCall/model_12/concatenate_12/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_12/dense_24/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_12/concatenate_12/concat", "StatefulPartitionedCall/model_12/dense_24/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_12/dense_24/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model_12/dense_25/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_12/dense_24/Relu", "StatefulPartitionedCall/model_12/dense_25/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_12/dense_25/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_12/dense_25/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model_12/normalization_24/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "unknown_1", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model_12/normalization_25/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "unknown_3", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model_12/normalization_26/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_12/concatenate_12/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_12/dense_24/MatMul/ReadVariableOp", "shape": [3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_12/dense_24/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_12/dense_25/MatMul/ReadVariableOp", "shape": [32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_12/dense_25/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}